/**
 * const实际上保证的，并不是变量的值不得改动，而是变量指向的那个内存地址不得改动。
 * 对于简单类型的数据（数值、字符串、布尔值），值就保存在变量指向的那个内存地址，
 * 因此等同于常量。
 * 但对于复合类型的数据（主要是对象和数组），变量指向的内存地址，保存的只是一个指针，
 * const只能保证这个指针是固定的，至于它指向的数据结构是不是可变的，就完全不能控制了。
 * 因此，将一个对象声明为常量必须非常小心。
 */

if (0) {
  const foo = {}

  // 为 foo 添加一个属性，可以成功
  foo.prop = 123
  foo.prop // 123

  // 将 foo 指向另一个对象，就会报错
  foo = {} // TypeError: "foo" is read-only

  /**
   * 上面代码中，常量foo储存的是一个地址，这个地址指向一个对象。不可变的只是这个地址，
   * 即不能把foo指向另一个地址，但对象本身是可变的，所以依然可以为其添加新属性。
   */
}

//如果真的想将对象冻结，应该使用Object.freeze方法。
if (1) {
  const foo = Object.freeze({})

  // 常规模式时，下面一行不起作用
  // 严格模式时，该行会报错
  foo.prop = 123
  console.log(foo)
}
